// 2. Тамагочі
// Створити об'єкт із властивостями: ім'я, здоров'я, ситість, сила, щастя. Об'єкт має створюватися через конструктор. В прототипі об'єкту мають бути методи для взаємодії з персонажем. (Годувати, Гратися, Гуляти, Спати, Лікуватися, <і ще, щось придумайте :)>)
// Кожні 3 секунди в персонажу мають зменшуватися показники. Відповідно викликаючи методи можна збілюшувати ці показники. Наприклад: тамагочі.гратися() - збільшує щастя на +5, і зменшує сили на -10 одиниць і ситість на -5 одиниць... Придумайти власні правила для персонажу.
// Інформацю про стан персонажу виводьте прямо на сторінку, після кожного оновлення стану. (вам домопоже document.getElementById('....'))
// У випадку смерті персонажу передбачити сумне повідомлення, і зупинити зміни інших показників.
function Tamagotchi(name, birthdate) {
    this.name = name;
    this.strength = 100;
    this.power = 100;
    this.hygiene = 100;
    this.foodLevel = 100;
    this.happinessLevel = 100;
    this.restedLevel = 100;
    this.healthLevel = 100;
}

var pet = new Tamagotchi('Загиблик');
